In [7]:
import sys
from pathlib import Path
import os



# Add project root to sys.path so `src` package is importable when running this file directly
sys.path.insert(0, str(Path(os.getcwd()).resolve().parent))

In [8]:
from config import settings

In [10]:
from src.sql import run_query

In [12]:
output = run_query("SELECT * FROM employees LIMIT 5;")

In [14]:
output

"[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)), (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)), (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)), (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)), (10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12))]"

In [20]:
import ast
import pandas as pd
import datetime

In [22]:
# safely evaluate the string into a Python object
# data = ast.literal_eval(output)
data = eval(output, {"datetime": datetime})  # Use eval here since output is already a list of tuples

# create a DataFrame
df = pd.DataFrame(data, columns=['emp_no', 'birth_date', 'first_name', 'last_name', 'gender', 'hire_date'])

df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12